using Tyuiu.AjtkuzhinovEE.Sprint3.Task4.V7.Lib;
internal class Program
{
    private static void Main(string[] args)
    {
        DataService ds = new DataService();
        
        Console.WriteLine("***********************************************************************************************************************************************************************************************************************************************");
        Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                                                                                                                                                                            *");
        Console.WriteLine("***********************************************************************************************************************************************************************************************************************************************");

        int startValue = -5;
        int stopValue = 5;

        Console.WriteLine($"Старт шага = {startValue}");
        Console.WriteLine($"Конец шага шага = {stopValue}");


        Console.WriteLine("*********************************************************************************************************************");
        Console.WriteLine("* РЕЗУЛЬТАТ:                                                                                                        *");
        Console.WriteLine("*********************************************************************************************************************");

        Console.WriteLine($"Сумма ряда: {ds.Calculate(startValue, stopValue)}");

        Console.ReadKey();
    }
}